zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
void printStatus() {
  const uint32_t now = millis();
  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0;
  const uint32_t vibrationAgeMs = haveVibrationStatus ? now - lastVibrationStatusMs : 0;
  const bool vibrationStatusFresh = haveVibrationStatus && vibrationAgeMs < MIC_STATUS_TIMEOUT_MS;
  const bool micStatusFresh = haveMicStatus && micAgeMs < MIC_STATUS_TIMEOUT_MS;
  const uint32_t vibrationLastMs = vibrationLastTriggerMs == 0 ? 0xFFFFFFFFUL : now - vibrationLastTriggerMs;
  const uint32_t pressureLastMs = pressureLastTriggerMs == 0 ? 0xFFFFFFFFUL : now - pressureLastTriggerMs;
  Serial.print("EVENT=M5_STATUS SERIAL_FRAMES=");
  Serial.print(serialFrameCount);
  Serial.print(" SERIAL_ERRORS=");
  Serial.print(serialErrorCount);
  Serial.print(" ESPNOW_TX=");
  Serial.print(espNowSendCount);
  Serial.print(" ESPNOW_FAIL=");
  Serial.print(espNowSendFailCount);
  Serial.print(" CMD_RX=");
  Serial.print(controlRxCount);
  Serial.print(" CMD_TX=");
  Serial.print(controlSendCount);
  Serial.print(" CMD_FAIL=");
  Serial.print(controlSendFailCount);
  Serial.print(" MIC_STATUS=");
  Serial.print(micStatusFresh ? "YES" : "NO");
  Serial.print(" SERIAL_AGE_MS=");
  Serial.print(haveEeg ? now - lastSerialFrameMs : 0);
  Serial.print(" MIC_AGE_MS=");
  Serial.print(micAgeMs);
  Serial.print(" EEG_SEQ=");
  Serial.print(haveEeg ? latestEegPacket.seq : 0);
  Serial.print(" POOR_SIGNAL=");
  Serial.print(haveEeg ? latestEegPacket.poorSignal : 255);
  Serial.print(" ATTENTION=");
  Serial.print(haveEeg ? latestEegPacket.attention : 0);
  Serial.print(" MEDITATION=");
  Serial.print(haveEeg ? latestEegPacket.meditation : 0);
  Serial.print(" MIC_RX=");
  Serial.print(latestMicStatus.rxCount);
  Serial.print(" MIC_DROP=");
  Serial.print(latestMicStatus.dropCount);
  Serial.print(" MIC_TIMEOUT=");
  Serial.print(latestMicStatus.timeoutCount);
  Serial.print(" MIC_LIGHT_MODE=");
  Serial.print(latestMicStatus.lightMode);
  Serial.print(" MIC_LIGHT_LEVEL=");
  Serial.print(latestMicStatus.lightLevel);
  Serial.print(" MIC_L1_R=");
  Serial.print(latestMicStatus.light1R);
  Serial.print(" MIC_L1_G=");
  Serial.print(latestMicStatus.light1G);
  Serial.print(" MIC_L1_B=");
  Serial.print(latestMicStatus.light1B);
  Serial.print(" MIC_L1_W=");
  Serial.print(latestMicStatus.light1W);
  Serial.print(" MIC_L2_R=");
  Serial.print(latestMicStatus.light2R);
  Serial.print(" MIC_L2_G=");
  Serial.print(latestMicStatus.light2G);
  Serial.print(" MIC_L2_B=");
  Serial.print(latestMicStatus.light2B);
  Serial.print(" MIC_L2_W=");
  Serial.print(latestMicStatus.light2W);
  Serial.print(" MIC_STEPPER=");
  Serial.print(latestMicStatus.stepperState);
  Serial.print(" MIC_RELAY=");
  Serial.print(latestMicStatus.relayState);
  Serial.print(" MIC_FAN=");
  Serial.print(latestMicStatus.fanState);
  Serial.print(" MIC_BUBBLE=");
  Serial.print(latestMicStatus.bubbleState);
  Serial.print(" MIC_BUBBLE_COUNT=");
  Serial.print(latestMicStatus.bubbleTriggerCount);
  Serial.print(" MIC_BUBBLE_ACTIVE_MS=");
  Serial.print(latestMicStatus.bubbleActiveMs);
  Serial.print(" MIC_SAFETY=");
  Serial.print(latestMicStatus.safetyState);
  Serial.print(" MIC_CONTROL_RX=");
  Serial.print(latestMicStatus.controlRxCount);
  Serial.print(" MIC_LAST_ACTION=");
  Serial.print(latestMicStatus.lastControlAction);
  Serial.print(" MIC_MANUAL_LIGHT=");
  Serial.print(latestMicStatus.manualLightEnabled);
  Serial.print(" MIC_RELAY_ENABLED=");
  Serial.print(latestMicStatus.relayOutputEnabled);
  Serial.print(" MIC_STEPPER_ENABLED=");
  Serial.print(latestMicStatus.stepperOutputEnabled);
  Serial.print(" MIC_BUBBLE_ENABLED=");
  Serial.print(latestMicStatus.bubbleOutputEnabled);
  Serial.print(" MIC_SYSTEM_ENABLED=");
  Serial.print(latestMicStatus.systemEnabled);
  Serial.print(" VIB_STATUS=");
  Serial.print(vibrationStatusFresh ? "YES" : "NO");
  Serial.print(" VIB_AGE_MS=");
  Serial.print(vibrationAgeMs);
  Serial.print(" VIB_DETECTED=");
  Serial.print(vibrationStatusFresh && latestVibrationStatus.vibrationDetected ? 1 : 0);
  Serial.print(" VIB_SENSOR=");
  Serial.print(vibrationStatusFresh ? latestVibrationStatus.sensorValue : 0);
  Serial.print(" VIB_BUBBLE=");
  Serial.print(vibrationStatusFresh ? latestVibrationStatus.bubbleState : 0);
  Serial.print(" VIB_TRIGGER_COUNT=");
  Serial.print(vibrationTriggerCount);
  Serial.print(" VIB_LAST_MS=");
  Serial.print(vibrationLastMs);
  Serial.print(" PRESSURE=");
  Serial.print(pressurePressed ? 1 : 0);
  Serial.print(" PRESSURE_TRIGGER_COUNT=");
  Serial.print(pressureTriggerCount);
  Serial.print(" PRESSURE_LAST_MS=");
  Serial.println(pressureLastMs);
}

void setup() {
  M5.begin();
  M5.Power.begin();
  Serial.begin(SERIAL_BAUD);
  delay(300);

  M5.Lcd.setBrightness(160);
  drawStaticScreen();

  Serial.println();
  Serial.print("EVENT=DREAM_BOOT BOARD=");
  Serial.print(BOARD_NAME);
  Serial.print(" ROLE=");
  Serial.println(DEVICE_ROLE);
  Serial.println("EVENT=SERIAL_READY INPUT=EEG_CSV TARGET=M5STACK");

  initPressureSensor();
  initEspNow();
  drawDashboard();
}

void loop() {
  M5.update();
  handleButtons();
  handlePressureSensor();
  handleVibrationTrigger();
  handleSerialInput();

  const uint32_t now = millis();
  if (now - lastDisplayRefreshMs >= DISPLAY_REFRESH_MS) {
    lastDisplayRefreshMs = now;
    drawDashboard();
  }

  if (now - lastStatusPrintMs >= STATUS_PRINT_MS) {
    lastStatusPrintMs = now;
    printStatus();
  }
}
